virtualabs/cutcutgo/src/packs/ATSAMA5D27CD1G_DFP/component/adc.h
#define ADC_CHDR_CH_Pos                       _U_(0)                                               /**< (ADC_CHDR Position) Channel xx Disable */
#define ADC_CHDR_CH_Msk                       (_U_(0xFFF) << ADC_CHDR_CH_Pos)                      /**< (ADC_CHDR Mask) CH */
#define ADC_CHDR_CH(value)                    (ADC_CHDR_CH_Msk & ((value) << ADC_CHDR_CH_Pos))     

/* -------- ADC_CHSR : (ADC Offset: 0x18) ( R/ 32) Channel Status Register -------- */
#define ADC_CHSR_CH0_Pos                      _U_(0)                                               /**< (ADC_CHSR) Channel 0 Status Position */
#define ADC_CHSR_CH0_Msk                      (_U_(0x1) << ADC_CHSR_CH0_Pos)                       /**< (ADC_CHSR) Channel 0 Status Mask */
#define ADC_CHSR_CH0(value)                   (ADC_CHSR_CH0_Msk & ((value) << ADC_CHSR_CH0_Pos))  
#define ADC_CHSR_CH1_Pos                      _U_(1)                                               /**< (ADC_CHSR) Channel 1 Status Position */
#define ADC_CHSR_CH1_Msk                      (_U_(0x1) << ADC_CHSR_CH1_Pos)                       /**< (ADC_CHSR) Channel 1 Status Mask */
#define ADC_CHSR_CH1(value)                   (ADC_CHSR_CH1_Msk & ((value) << ADC_CHSR_CH1_Pos))  
#define ADC_CHSR_CH2_Pos                      _U_(2)                                               /**< (ADC_CHSR) Channel 2 Status Position */
#define ADC_CHSR_CH2_Msk                      (_U_(0x1) << ADC_CHSR_CH2_Pos)                       /**< (ADC_CHSR) Channel 2 Status Mask */
#define ADC_CHSR_CH2(value)                   (ADC_CHSR_CH2_Msk & ((value) << ADC_CHSR_CH2_Pos))  
#define ADC_CHSR_CH3_Pos                      _U_(3)                                               /**< (ADC_CHSR) Channel 3 Status Position */
#define ADC_CHSR_CH3_Msk                      (_U_(0x1) << ADC_CHSR_CH3_Pos)                       /**< (ADC_CHSR) Channel 3 Status Mask */
#define ADC_CHSR_CH3(value)                   (ADC_CHSR_CH3_Msk & ((value) << ADC_CHSR_CH3_Pos))  
#define ADC_CHSR_CH4_Pos                      _U_(4)                                               /**< (ADC_CHSR) Channel 4 Status Position */
#define ADC_CHSR_CH4_Msk                      (_U_(0x1) << ADC_CHSR_CH4_Pos)                       /**< (ADC_CHSR) Channel 4 Status Mask */
#define ADC_CHSR_CH4(value)                   (ADC_CHSR_CH4_Msk & ((value) << ADC_CHSR_CH4_Pos))  
#define ADC_CHSR_CH5_Pos                      _U_(5)                                               /**< (ADC_CHSR) Channel 5 Status Position */
#define ADC_CHSR_CH5_Msk                      (_U_(0x1) << ADC_CHSR_CH5_Pos)                       /**< (ADC_CHSR) Channel 5 Status Mask */
#define ADC_CHSR_CH5(value)                   (ADC_CHSR_CH5_Msk & ((value) << ADC_CHSR_CH5_Pos))  
#define ADC_CHSR_CH6_Pos                      _U_(6)                                               /**< (ADC_CHSR) Channel 6 Status Position */
#define ADC_CHSR_CH6_Msk                      (_U_(0x1) << ADC_CHSR_CH6_Pos)                       /**< (ADC_CHSR) Channel 6 Status Mask */
#define ADC_CHSR_CH6(value)                   (ADC_CHSR_CH6_Msk & ((value) << ADC_CHSR_CH6_Pos))  
#define ADC_CHSR_CH7_Pos                      _U_(7)                                               /**< (ADC_CHSR) Channel 7 Status Position */
#define ADC_CHSR_CH7_Msk                      (_U_(0x1) << ADC_CHSR_CH7_Pos)                       /**< (ADC_CHSR) Channel 7 Status Mask */
#define ADC_CHSR_CH7(value)                   (ADC_CHSR_CH7_Msk & ((value) << ADC_CHSR_CH7_Pos))  
#define ADC_CHSR_CH8_Pos                      _U_(8)                                               /**< (ADC_CHSR) Channel 8 Status Position */
#define ADC_CHSR_CH8_Msk                      (_U_(0x1) << ADC_CHSR_CH8_Pos)                       /**< (ADC_CHSR) Channel 8 Status Mask */
#define ADC_CHSR_CH8(value)                   (ADC_CHSR_CH8_Msk & ((value) << ADC_CHSR_CH8_Pos))  
#define ADC_CHSR_CH9_Pos                      _U_(9)                                               /**< (ADC_CHSR) Channel 9 Status Position */
#define ADC_CHSR_CH9_Msk                      (_U_(0x1) << ADC_CHSR_CH9_Pos)                       /**< (ADC_CHSR) Channel 9 Status Mask */
#define ADC_CHSR_CH9(value)                   (ADC_CHSR_CH9_Msk & ((value) << ADC_CHSR_CH9_Pos))  
#define ADC_CHSR_CH10_Pos                     _U_(10)                                              /**< (ADC_CHSR) Channel 10 Status Position */
#define ADC_CHSR_CH10_Msk                     (_U_(0x1) << ADC_CHSR_CH10_Pos)                      /**< (ADC_CHSR) Channel 10 Status Mask */
#define ADC_CHSR_CH10(value)                  (ADC_CHSR_CH10_Msk & ((value) << ADC_CHSR_CH10_Pos))
#define ADC_CHSR_CH11_Pos                     _U_(11)                                              /**< (ADC_CHSR) Channel 11 Status Position */
#define ADC_CHSR_CH11_Msk                     (_U_(0x1) << ADC_CHSR_CH11_Pos)                      /**< (ADC_CHSR) Channel 11 Status Mask */
#define ADC_CHSR_CH11(value)                  (ADC_CHSR_CH11_Msk & ((value) << ADC_CHSR_CH11_Pos))
#define ADC_CHSR_Msk                          _U_(0x00000FFF)                                      /**< (ADC_CHSR) Register Mask  */

#define ADC_CHSR_CH_Pos                       _U_(0)                                               /**< (ADC_CHSR Position) Channel xx Status */
#define ADC_CHSR_CH_Msk                       (_U_(0xFFF) << ADC_CHSR_CH_Pos)                      /**< (ADC_CHSR Mask) CH */
#define ADC_CHSR_CH(value)                    (ADC_CHSR_CH_Msk & ((value) << ADC_CHSR_CH_Pos))     

/* -------- ADC_LCDR : (ADC Offset: 0x20) ( R/ 32) Last Converted Data Register -------- */
#define ADC_LCDR_LDATA_Pos                    _U_(0)                                               /**< (ADC_LCDR) Last Data Converted Position */
#define ADC_LCDR_LDATA_Msk                    (_U_(0xFFFF) << ADC_LCDR_LDATA_Pos)                  /**< (ADC_LCDR) Last Data Converted Mask */
#define ADC_LCDR_LDATA(value)                 (ADC_LCDR_LDATA_Msk & ((value) << ADC_LCDR_LDATA_Pos))
#define ADC_LCDR_CHNBOSR_Pos                  _U_(24)                                              /**< (ADC_LCDR) Channel Number in Oversampling Mode Position */
#define ADC_LCDR_CHNBOSR_Msk                  (_U_(0x1F) << ADC_LCDR_CHNBOSR_Pos)                  /**< (ADC_LCDR) Channel Number in Oversampling Mode Mask */
#define ADC_LCDR_CHNBOSR(value)               (ADC_LCDR_CHNBOSR_Msk & ((value) << ADC_LCDR_CHNBOSR_Pos))
#define ADC_LCDR_Msk                          _U_(0x1F00FFFF)                                      /**< (ADC_LCDR) Register Mask  */


/* -------- ADC_IER : (ADC Offset: 0x24) ( /W 32) Interrupt Enable Register -------- */
#define ADC_IER_EOC0_Pos                      _U_(0)                                               /**< (ADC_IER) End of Conversion Interrupt Enable 0 Position */
#define ADC_IER_EOC0_Msk                      (_U_(0x1) << ADC_IER_EOC0_Pos)                       /**< (ADC_IER) End of Conversion Interrupt Enable 0 Mask */
#define ADC_IER_EOC0(value)                   (ADC_IER_EOC0_Msk & ((value) << ADC_IER_EOC0_Pos))  
#define ADC_IER_EOC1_Pos                      _U_(1)                                               /**< (ADC_IER) End of Conversion Interrupt Enable 1 Position */
#define ADC_IER_EOC1_Msk                      (_U_(0x1) << ADC_IER_EOC1_Pos)                       /**< (ADC_IER) End of Conversion Interrupt Enable 1 Mask */
#define ADC_IER_EOC1(value)                   (ADC_IER_EOC1_Msk & ((value) << ADC_IER_EOC1_Pos))  
#define ADC_IER_EOC2_Pos                      _U_(2)                                               /**< (ADC_IER) End of Conversion Interrupt Enable 2 Position */
#define ADC_IER_EOC2_Msk                      (_U_(0x1) << ADC_IER_EOC2_Pos)                       /**< (ADC_IER) End of Conversion Interrupt Enable 2 Mask */
#define ADC_IER_EOC2(value)                   (ADC_IER_EOC2_Msk & ((value) << ADC_IER_EOC2_Pos))  
#define ADC_IER_EOC3_Pos                      _U_(3)                                               /**< (ADC_IER) End of Conversion Interrupt Enable 3 Position */
#define ADC_IER_EOC3_Msk                      (_U_(0x1) << ADC_IER_EOC3_Pos)                       /**< (ADC_IER) End of Conversion Interrupt Enable 3 Mask */
#define ADC_IER_EOC3(value)                   (ADC_IER_EOC3_Msk & ((value) << ADC_IER_EOC3_Pos))  
#define ADC_IER_EOC4_Pos                      _U_(4)                                               /**< (ADC_IER) End of Conversion Interrupt Enable 4 Position */
#define ADC_IER_EOC4_Msk                      (_U_(0x1) << ADC_IER_EOC4_Pos)                       /**< (ADC_IER) End of Conversion Interrupt Enable 4 Mask */
#define ADC_IER_EOC4(value)                   (ADC_IER_EOC4_Msk & ((value) << ADC_IER_EOC4_Pos))  
#define ADC_IER_EOC5_Pos                      _U_(5)                                               /**< (ADC_IER) End of Conversion Interrupt Enable 5 Position */
#define ADC_IER_EOC5_Msk                      (_U_(0x1) << ADC_IER_EOC5_Pos)                       /**< (ADC_IER) End of Conversion Interrupt Enable 5 Mask */
#define ADC_IER_EOC5(value)                   (ADC_IER_EOC5_Msk & ((value) << ADC_IER_EOC5_Pos))  
#define ADC_IER_EOC6_Pos                      _U_(6)                                               /**< (ADC_IER) End of Conversion Interrupt Enable 6 Position */
#define ADC_IER_EOC6_Msk                      (_U_(0x1) << ADC_IER_EOC6_Pos)                       /**< (ADC_IER) End of Conversion Interrupt Enable 6 Mask */
#define ADC_IER_EOC6(value)                   (ADC_IER_EOC6_Msk & ((value) << ADC_IER_EOC6_Pos))  
#define ADC_IER_EOC7_Pos                      _U_(7)                                               /**< (ADC_IER) End of Conversion Interrupt Enable 7 Position */
#define ADC_IER_EOC7_Msk                      (_U_(0x1) << ADC_IER_EOC7_Pos)                       /**< (ADC_IER) End of Conversion Interrupt Enable 7 Mask */
#define ADC_IER_EOC7(value)                   (ADC_IER_EOC7_Msk & ((value) << ADC_IER_EOC7_Pos))  
#define ADC_IER_EOC8_Pos                      _U_(8)                                               /**< (ADC_IER) End of Conversion Interrupt Enable 8 Position */
#define ADC_IER_EOC8_Msk                      (_U_(0x1) << ADC_IER_EOC8_Pos)                       /**< (ADC_IER) End of Conversion Interrupt Enable 8 Mask */
#define ADC_IER_EOC8(value)                   (ADC_IER_EOC8_Msk & ((value) << ADC_IER_EOC8_Pos))  
#define ADC_IER_EOC9_Pos                      _U_(9)                                               /**< (ADC_IER) End of Conversion Interrupt Enable 9 Position */
#define ADC_IER_EOC9_Msk                      (_U_(0x1) << ADC_IER_EOC9_Pos)                       /**< (ADC_IER) End of Conversion Interrupt Enable 9 Mask */
#define ADC_IER_EOC9(value)                   (ADC_IER_EOC9_Msk & ((value) << ADC_IER_EOC9_Pos))  
#define ADC_IER_EOC10_Pos                     _U_(10)                                              /**< (ADC_IER) End of Conversion Interrupt Enable 10 Position */
#define ADC_IER_EOC10_Msk                     (_U_(0x1) << ADC_IER_EOC10_Pos)                      /**< (ADC_IER) End of Conversion Interrupt Enable 10 Mask */
#define ADC_IER_EOC10(value)                  (ADC_IER_EOC10_Msk & ((value) << ADC_IER_EOC10_Pos))
#define ADC_IER_EOC11_Pos                     _U_(11)                                              /**< (ADC_IER) End of Conversion Interrupt Enable 11 Position */
#define ADC_IER_EOC11_Msk                     (_U_(0x1) << ADC_IER_EOC11_Pos)                      /**< (ADC_IER) End of Conversion Interrupt Enable 11 Mask */
#define ADC_IER_EOC11(value)                  (ADC_IER_EOC11_Msk & ((value) << ADC_IER_EOC11_Pos))
#define ADC_IER_LCCHG_Pos                     _U_(19)                                              /**< (ADC_IER) Last Channel Change Interrupt Enable Position */
#define ADC_IER_LCCHG_Msk                     (_U_(0x1) << ADC_IER_LCCHG_Pos)                      /**< (ADC_IER) Last Channel Change Interrupt Enable Mask */
#define ADC_IER_LCCHG(value)                  (ADC_IER_LCCHG_Msk & ((value) << ADC_IER_LCCHG_Pos))
#define ADC_IER_XRDY_Pos                      _U_(20)                                              /**< (ADC_IER) Touchscreen Measure XPOS Ready Interrupt Enable Position */
#define ADC_IER_XRDY_Msk                      (_U_(0x1) << ADC_IER_XRDY_Pos)                       /**< (ADC_IER) Touchscreen Measure XPOS Ready Interrupt Enable Mask */
#define ADC_IER_XRDY(value)                   (ADC_IER_XRDY_Msk & ((value) << ADC_IER_XRDY_Pos))  
#define ADC_IER_YRDY_Pos                      _U_(21)                                              /**< (ADC_IER) Touchscreen Measure YPOS Ready Interrupt Enable Position */
#define ADC_IER_YRDY_Msk                      (_U_(0x1) << ADC_IER_YRDY_Pos)                       /**< (ADC_IER) Touchscreen Measure YPOS Ready Interrupt Enable Mask */
#define ADC_IER_YRDY(value)                   (ADC_IER_YRDY_Msk & ((value) << ADC_IER_YRDY_Pos))  
#define ADC_IER_PRDY_Pos                      _U_(22)                                              /**< (ADC_IER) Touchscreen Measure Pressure Ready Interrupt Enable Position */
#define ADC_IER_PRDY_Msk                      (_U_(0x1) << ADC_IER_PRDY_Pos)                       /**< (ADC_IER) Touchscreen Measure Pressure Ready Interrupt Enable Mask */
#define ADC_IER_PRDY(value)                   (ADC_IER_PRDY_Msk & ((value) << ADC_IER_PRDY_Pos))  
#define ADC_IER_DRDY_Pos                      _U_(24)                                              /**< (ADC_IER) Data Ready Interrupt Enable Position */
#define ADC_IER_DRDY_Msk                      (_U_(0x1) << ADC_IER_DRDY_Pos)                       /**< (ADC_IER) Data Ready Interrupt Enable Mask */
#define ADC_IER_DRDY(value)                   (ADC_IER_DRDY_Msk & ((value) << ADC_IER_DRDY_Pos))  
#define ADC_IER_GOVRE_Pos                     _U_(25)                                              /**< (ADC_IER) General Overrun Error Interrupt Enable Position */
#define ADC_IER_GOVRE_Msk                     (_U_(0x1) << ADC_IER_GOVRE_Pos)                      /**< (ADC_IER) General Overrun Error Interrupt Enable Mask */
#define ADC_IER_GOVRE(value)                  (ADC_IER_GOVRE_Msk & ((value) << ADC_IER_GOVRE_Pos))
#define ADC_IER_COMPE_Pos                     _U_(26)                                              /**< (ADC_IER) Comparison Event Interrupt Enable Position */
#define ADC_IER_COMPE_Msk                     (_U_(0x1) << ADC_IER_COMPE_Pos)                      /**< (ADC_IER) Comparison Event Interrupt Enable Mask */
#define ADC_IER_COMPE(value)                  (ADC_IER_COMPE_Msk & ((value) << ADC_IER_COMPE_Pos))
#define ADC_IER_PEN_Pos                       _U_(29)                                              /**< (ADC_IER) Pen Contact Interrupt Enable Position */
#define ADC_IER_PEN_Msk                       (_U_(0x1) << ADC_IER_PEN_Pos)                        /**< (ADC_IER) Pen Contact Interrupt Enable Mask */
#define ADC_IER_PEN(value)                    (ADC_IER_PEN_Msk & ((value) << ADC_IER_PEN_Pos))    
#define ADC_IER_NOPEN_Pos                     _U_(30)                                              /**< (ADC_IER) No Pen Contact Interrupt Enable Position */
#define ADC_IER_NOPEN_Msk                     (_U_(0x1) << ADC_IER_NOPEN_Pos)                      /**< (ADC_IER) No Pen Contact Interrupt Enable Mask */
#define ADC_IER_NOPEN(value)                  (ADC_IER_NOPEN_Msk & ((value) << ADC_IER_NOPEN_Pos))
#define ADC_IER_Msk                           _U_(0x67780FFF)                                      /**< (ADC_IER) Register Mask  */

#define ADC_IER_EOC_Pos                       _U_(0)                                               /**< (ADC_IER Position) End of Conversion Interrupt Enable x */
#define ADC_IER_EOC_Msk                       (_U_(0xFFF) << ADC_IER_EOC_Pos)                      /**< (ADC_IER Mask) EOC */
#define ADC_IER_EOC(value)                    (ADC_IER_EOC_Msk & ((value) << ADC_IER_EOC_Pos))     

