virtualabs/cutcutgo/src/packs/ATSAMA5D27CD1G_DFP/component/adc.h
#define ADC_IDR_EOC_Pos                       _U_(0)                                               /**< (ADC_IDR Position) End of Conversion Interrupt Disable x */
#define ADC_IDR_EOC_Msk                       (_U_(0xFFF) << ADC_IDR_EOC_Pos)                      /**< (ADC_IDR Mask) EOC */
#define ADC_IDR_EOC(value)                    (ADC_IDR_EOC_Msk & ((value) << ADC_IDR_EOC_Pos))     

/* -------- ADC_IMR : (ADC Offset: 0x2C) ( R/ 32) Interrupt Mask Register -------- */
#define ADC_IMR_EOC0_Pos                      _U_(0)                                               /**< (ADC_IMR) End of Conversion Interrupt Mask 0 Position */
#define ADC_IMR_EOC0_Msk                      (_U_(0x1) << ADC_IMR_EOC0_Pos)                       /**< (ADC_IMR) End of Conversion Interrupt Mask 0 Mask */
#define ADC_IMR_EOC0(value)                   (ADC_IMR_EOC0_Msk & ((value) << ADC_IMR_EOC0_Pos))  
#define ADC_IMR_EOC1_Pos                      _U_(1)                                               /**< (ADC_IMR) End of Conversion Interrupt Mask 1 Position */
#define ADC_IMR_EOC1_Msk                      (_U_(0x1) << ADC_IMR_EOC1_Pos)                       /**< (ADC_IMR) End of Conversion Interrupt Mask 1 Mask */
#define ADC_IMR_EOC1(value)                   (ADC_IMR_EOC1_Msk & ((value) << ADC_IMR_EOC1_Pos))  
#define ADC_IMR_EOC2_Pos                      _U_(2)                                               /**< (ADC_IMR) End of Conversion Interrupt Mask 2 Position */
#define ADC_IMR_EOC2_Msk                      (_U_(0x1) << ADC_IMR_EOC2_Pos)                       /**< (ADC_IMR) End of Conversion Interrupt Mask 2 Mask */
#define ADC_IMR_EOC2(value)                   (ADC_IMR_EOC2_Msk & ((value) << ADC_IMR_EOC2_Pos))  
#define ADC_IMR_EOC3_Pos                      _U_(3)                                               /**< (ADC_IMR) End of Conversion Interrupt Mask 3 Position */
#define ADC_IMR_EOC3_Msk                      (_U_(0x1) << ADC_IMR_EOC3_Pos)                       /**< (ADC_IMR) End of Conversion Interrupt Mask 3 Mask */
#define ADC_IMR_EOC3(value)                   (ADC_IMR_EOC3_Msk & ((value) << ADC_IMR_EOC3_Pos))  
#define ADC_IMR_EOC4_Pos                      _U_(4)                                               /**< (ADC_IMR) End of Conversion Interrupt Mask 4 Position */
#define ADC_IMR_EOC4_Msk                      (_U_(0x1) << ADC_IMR_EOC4_Pos)                       /**< (ADC_IMR) End of Conversion Interrupt Mask 4 Mask */
#define ADC_IMR_EOC4(value)                   (ADC_IMR_EOC4_Msk & ((value) << ADC_IMR_EOC4_Pos))  
#define ADC_IMR_EOC5_Pos                      _U_(5)                                               /**< (ADC_IMR) End of Conversion Interrupt Mask 5 Position */
#define ADC_IMR_EOC5_Msk                      (_U_(0x1) << ADC_IMR_EOC5_Pos)                       /**< (ADC_IMR) End of Conversion Interrupt Mask 5 Mask */
#define ADC_IMR_EOC5(value)                   (ADC_IMR_EOC5_Msk & ((value) << ADC_IMR_EOC5_Pos))  
#define ADC_IMR_EOC6_Pos                      _U_(6)                                               /**< (ADC_IMR) End of Conversion Interrupt Mask 6 Position */
#define ADC_IMR_EOC6_Msk                      (_U_(0x1) << ADC_IMR_EOC6_Pos)                       /**< (ADC_IMR) End of Conversion Interrupt Mask 6 Mask */
#define ADC_IMR_EOC6(value)                   (ADC_IMR_EOC6_Msk & ((value) << ADC_IMR_EOC6_Pos))  
#define ADC_IMR_EOC7_Pos                      _U_(7)                                               /**< (ADC_IMR) End of Conversion Interrupt Mask 7 Position */
#define ADC_IMR_EOC7_Msk                      (_U_(0x1) << ADC_IMR_EOC7_Pos)                       /**< (ADC_IMR) End of Conversion Interrupt Mask 7 Mask */
#define ADC_IMR_EOC7(value)                   (ADC_IMR_EOC7_Msk & ((value) << ADC_IMR_EOC7_Pos))  
#define ADC_IMR_EOC8_Pos                      _U_(8)                                               /**< (ADC_IMR) End of Conversion Interrupt Mask 8 Position */
#define ADC_IMR_EOC8_Msk                      (_U_(0x1) << ADC_IMR_EOC8_Pos)                       /**< (ADC_IMR) End of Conversion Interrupt Mask 8 Mask */
#define ADC_IMR_EOC8(value)                   (ADC_IMR_EOC8_Msk & ((value) << ADC_IMR_EOC8_Pos))  
#define ADC_IMR_EOC9_Pos                      _U_(9)                                               /**< (ADC_IMR) End of Conversion Interrupt Mask 9 Position */
#define ADC_IMR_EOC9_Msk                      (_U_(0x1) << ADC_IMR_EOC9_Pos)                       /**< (ADC_IMR) End of Conversion Interrupt Mask 9 Mask */
#define ADC_IMR_EOC9(value)                   (ADC_IMR_EOC9_Msk & ((value) << ADC_IMR_EOC9_Pos))  
#define ADC_IMR_EOC10_Pos                     _U_(10)                                              /**< (ADC_IMR) End of Conversion Interrupt Mask 10 Position */
#define ADC_IMR_EOC10_Msk                     (_U_(0x1) << ADC_IMR_EOC10_Pos)                      /**< (ADC_IMR) End of Conversion Interrupt Mask 10 Mask */
#define ADC_IMR_EOC10(value)                  (ADC_IMR_EOC10_Msk & ((value) << ADC_IMR_EOC10_Pos))
#define ADC_IMR_EOC11_Pos                     _U_(11)                                              /**< (ADC_IMR) End of Conversion Interrupt Mask 11 Position */
#define ADC_IMR_EOC11_Msk                     (_U_(0x1) << ADC_IMR_EOC11_Pos)                      /**< (ADC_IMR) End of Conversion Interrupt Mask 11 Mask */
#define ADC_IMR_EOC11(value)                  (ADC_IMR_EOC11_Msk & ((value) << ADC_IMR_EOC11_Pos))
#define ADC_IMR_LCCHG_Pos                     _U_(19)                                              /**< (ADC_IMR) Last Channel Change Interrupt Disable Position */
#define ADC_IMR_LCCHG_Msk                     (_U_(0x1) << ADC_IMR_LCCHG_Pos)                      /**< (ADC_IMR) Last Channel Change Interrupt Disable Mask */
#define ADC_IMR_LCCHG(value)                  (ADC_IMR_LCCHG_Msk & ((value) << ADC_IMR_LCCHG_Pos))
#define ADC_IMR_XRDY_Pos                      _U_(20)                                              /**< (ADC_IMR) Touchscreen Measure XPOS Ready Interrupt Mask Position */
#define ADC_IMR_XRDY_Msk                      (_U_(0x1) << ADC_IMR_XRDY_Pos)                       /**< (ADC_IMR) Touchscreen Measure XPOS Ready Interrupt Mask Mask */
#define ADC_IMR_XRDY(value)                   (ADC_IMR_XRDY_Msk & ((value) << ADC_IMR_XRDY_Pos))  
#define ADC_IMR_YRDY_Pos                      _U_(21)                                              /**< (ADC_IMR) Touchscreen Measure YPOS Ready Interrupt Mask Position */
#define ADC_IMR_YRDY_Msk                      (_U_(0x1) << ADC_IMR_YRDY_Pos)                       /**< (ADC_IMR) Touchscreen Measure YPOS Ready Interrupt Mask Mask */
#define ADC_IMR_YRDY(value)                   (ADC_IMR_YRDY_Msk & ((value) << ADC_IMR_YRDY_Pos))  
#define ADC_IMR_PRDY_Pos                      _U_(22)                                              /**< (ADC_IMR) Touchscreen Measure Pressure Ready Interrupt Mask Position */
#define ADC_IMR_PRDY_Msk                      (_U_(0x1) << ADC_IMR_PRDY_Pos)                       /**< (ADC_IMR) Touchscreen Measure Pressure Ready Interrupt Mask Mask */
#define ADC_IMR_PRDY(value)                   (ADC_IMR_PRDY_Msk & ((value) << ADC_IMR_PRDY_Pos))  
#define ADC_IMR_DRDY_Pos                      _U_(24)                                              /**< (ADC_IMR) Data Ready Interrupt Mask Position */
#define ADC_IMR_DRDY_Msk                      (_U_(0x1) << ADC_IMR_DRDY_Pos)                       /**< (ADC_IMR) Data Ready Interrupt Mask Mask */
#define ADC_IMR_DRDY(value)                   (ADC_IMR_DRDY_Msk & ((value) << ADC_IMR_DRDY_Pos))  
#define ADC_IMR_GOVRE_Pos                     _U_(25)                                              /**< (ADC_IMR) General Overrun Error Interrupt Mask Position */
#define ADC_IMR_GOVRE_Msk                     (_U_(0x1) << ADC_IMR_GOVRE_Pos)                      /**< (ADC_IMR) General Overrun Error Interrupt Mask Mask */
#define ADC_IMR_GOVRE(value)                  (ADC_IMR_GOVRE_Msk & ((value) << ADC_IMR_GOVRE_Pos))
#define ADC_IMR_COMPE_Pos                     _U_(26)                                              /**< (ADC_IMR) Comparison Event Interrupt Mask Position */
#define ADC_IMR_COMPE_Msk                     (_U_(0x1) << ADC_IMR_COMPE_Pos)                      /**< (ADC_IMR) Comparison Event Interrupt Mask Mask */
#define ADC_IMR_COMPE(value)                  (ADC_IMR_COMPE_Msk & ((value) << ADC_IMR_COMPE_Pos))
#define ADC_IMR_PEN_Pos                       _U_(29)                                              /**< (ADC_IMR) Pen Contact Interrupt Mask Position */
#define ADC_IMR_PEN_Msk                       (_U_(0x1) << ADC_IMR_PEN_Pos)                        /**< (ADC_IMR) Pen Contact Interrupt Mask Mask */
#define ADC_IMR_PEN(value)                    (ADC_IMR_PEN_Msk & ((value) << ADC_IMR_PEN_Pos))    
#define ADC_IMR_NOPEN_Pos                     _U_(30)                                              /**< (ADC_IMR) No Pen Contact Interrupt Mask Position */
#define ADC_IMR_NOPEN_Msk                     (_U_(0x1) << ADC_IMR_NOPEN_Pos)                      /**< (ADC_IMR) No Pen Contact Interrupt Mask Mask */
#define ADC_IMR_NOPEN(value)                  (ADC_IMR_NOPEN_Msk & ((value) << ADC_IMR_NOPEN_Pos))
#define ADC_IMR_Msk                           _U_(0x67780FFF)                                      /**< (ADC_IMR) Register Mask  */

#define ADC_IMR_EOC_Pos                       _U_(0)                                               /**< (ADC_IMR Position) End of Conversion Interrupt Mask x */
#define ADC_IMR_EOC_Msk                       (_U_(0xFFF) << ADC_IMR_EOC_Pos)                      /**< (ADC_IMR Mask) EOC */
#define ADC_IMR_EOC(value)                    (ADC_IMR_EOC_Msk & ((value) << ADC_IMR_EOC_Pos))     

/* -------- ADC_ISR : (ADC Offset: 0x30) ( R/ 32) Interrupt Status Register -------- */
#define ADC_ISR_EOC0_Pos                      _U_(0)                                               /**< (ADC_ISR) End of Conversion 0 (automatically set / cleared) Position */
#define ADC_ISR_EOC0_Msk                      (_U_(0x1) << ADC_ISR_EOC0_Pos)                       /**< (ADC_ISR) End of Conversion 0 (automatically set / cleared) Mask */
#define ADC_ISR_EOC0(value)                   (ADC_ISR_EOC0_Msk & ((value) << ADC_ISR_EOC0_Pos))  
#define ADC_ISR_EOC1_Pos                      _U_(1)                                               /**< (ADC_ISR) End of Conversion 1 (automatically set / cleared) Position */
#define ADC_ISR_EOC1_Msk                      (_U_(0x1) << ADC_ISR_EOC1_Pos)                       /**< (ADC_ISR) End of Conversion 1 (automatically set / cleared) Mask */
#define ADC_ISR_EOC1(value)                   (ADC_ISR_EOC1_Msk & ((value) << ADC_ISR_EOC1_Pos))  
#define ADC_ISR_EOC2_Pos                      _U_(2)                                               /**< (ADC_ISR) End of Conversion 2 (automatically set / cleared) Position */
#define ADC_ISR_EOC2_Msk                      (_U_(0x1) << ADC_ISR_EOC2_Pos)                       /**< (ADC_ISR) End of Conversion 2 (automatically set / cleared) Mask */
#define ADC_ISR_EOC2(value)                   (ADC_ISR_EOC2_Msk & ((value) << ADC_ISR_EOC2_Pos))  
#define ADC_ISR_EOC3_Pos                      _U_(3)                                               /**< (ADC_ISR) End of Conversion 3 (automatically set / cleared) Position */
#define ADC_ISR_EOC3_Msk                      (_U_(0x1) << ADC_ISR_EOC3_Pos)                       /**< (ADC_ISR) End of Conversion 3 (automatically set / cleared) Mask */
#define ADC_ISR_EOC3(value)                   (ADC_ISR_EOC3_Msk & ((value) << ADC_ISR_EOC3_Pos))  
#define ADC_ISR_EOC4_Pos                      _U_(4)                                               /**< (ADC_ISR) End of Conversion 4 (automatically set / cleared) Position */
#define ADC_ISR_EOC4_Msk                      (_U_(0x1) << ADC_ISR_EOC4_Pos)                       /**< (ADC_ISR) End of Conversion 4 (automatically set / cleared) Mask */
#define ADC_ISR_EOC4(value)                   (ADC_ISR_EOC4_Msk & ((value) << ADC_ISR_EOC4_Pos))  
#define ADC_ISR_EOC5_Pos                      _U_(5)                                               /**< (ADC_ISR) End of Conversion 5 (automatically set / cleared) Position */
#define ADC_ISR_EOC5_Msk                      (_U_(0x1) << ADC_ISR_EOC5_Pos)                       /**< (ADC_ISR) End of Conversion 5 (automatically set / cleared) Mask */
#define ADC_ISR_EOC5(value)                   (ADC_ISR_EOC5_Msk & ((value) << ADC_ISR_EOC5_Pos))  
#define ADC_ISR_EOC6_Pos                      _U_(6)                                               /**< (ADC_ISR) End of Conversion 6 (automatically set / cleared) Position */
#define ADC_ISR_EOC6_Msk                      (_U_(0x1) << ADC_ISR_EOC6_Pos)                       /**< (ADC_ISR) End of Conversion 6 (automatically set / cleared) Mask */
#define ADC_ISR_EOC6(value)                   (ADC_ISR_EOC6_Msk & ((value) << ADC_ISR_EOC6_Pos))  
#define ADC_ISR_EOC7_Pos                      _U_(7)                                               /**< (ADC_ISR) End of Conversion 7 (automatically set / cleared) Position */
#define ADC_ISR_EOC7_Msk                      (_U_(0x1) << ADC_ISR_EOC7_Pos)                       /**< (ADC_ISR) End of Conversion 7 (automatically set / cleared) Mask */
#define ADC_ISR_EOC7(value)                   (ADC_ISR_EOC7_Msk & ((value) << ADC_ISR_EOC7_Pos))  
#define ADC_ISR_EOC8_Pos                      _U_(8)                                               /**< (ADC_ISR) End of Conversion 8 (automatically set / cleared) Position */
#define ADC_ISR_EOC8_Msk                      (_U_(0x1) << ADC_ISR_EOC8_Pos)                       /**< (ADC_ISR) End of Conversion 8 (automatically set / cleared) Mask */
#define ADC_ISR_EOC8(value)                   (ADC_ISR_EOC8_Msk & ((value) << ADC_ISR_EOC8_Pos))  
#define ADC_ISR_EOC9_Pos                      _U_(9)                                               /**< (ADC_ISR) End of Conversion 9 (automatically set / cleared) Position */
#define ADC_ISR_EOC9_Msk                      (_U_(0x1) << ADC_ISR_EOC9_Pos)                       /**< (ADC_ISR) End of Conversion 9 (automatically set / cleared) Mask */
#define ADC_ISR_EOC9(value)                   (ADC_ISR_EOC9_Msk & ((value) << ADC_ISR_EOC9_Pos))  
#define ADC_ISR_EOC10_Pos                     _U_(10)                                              /**< (ADC_ISR) End of Conversion 10 (automatically set / cleared) Position */
#define ADC_ISR_EOC10_Msk                     (_U_(0x1) << ADC_ISR_EOC10_Pos)                      /**< (ADC_ISR) End of Conversion 10 (automatically set / cleared) Mask */
#define ADC_ISR_EOC10(value)                  (ADC_ISR_EOC10_Msk & ((value) << ADC_ISR_EOC10_Pos))
#define ADC_ISR_EOC11_Pos                     _U_(11)                                              /**< (ADC_ISR) End of Conversion 11 (automatically set / cleared) Position */
#define ADC_ISR_EOC11_Msk                     (_U_(0x1) << ADC_ISR_EOC11_Pos)                      /**< (ADC_ISR) End of Conversion 11 (automatically set / cleared) Mask */
#define ADC_ISR_EOC11(value)                  (ADC_ISR_EOC11_Msk & ((value) << ADC_ISR_EOC11_Pos))
#define ADC_ISR_LCCHG_Pos                     _U_(19)                                              /**< (ADC_ISR) Last Channel Change (cleared on read) Position */
#define ADC_ISR_LCCHG_Msk                     (_U_(0x1) << ADC_ISR_LCCHG_Pos)                      /**< (ADC_ISR) Last Channel Change (cleared on read) Mask */
#define ADC_ISR_LCCHG(value)                  (ADC_ISR_LCCHG_Msk & ((value) << ADC_ISR_LCCHG_Pos))
#define ADC_ISR_XRDY_Pos                      _U_(20)                                              /**< (ADC_ISR) Touchscreen XPOS Measure Ready (cleared on read) Position */
#define ADC_ISR_XRDY_Msk                      (_U_(0x1) << ADC_ISR_XRDY_Pos)                       /**< (ADC_ISR) Touchscreen XPOS Measure Ready (cleared on read) Mask */
#define ADC_ISR_XRDY(value)                   (ADC_ISR_XRDY_Msk & ((value) << ADC_ISR_XRDY_Pos))  
#define ADC_ISR_YRDY_Pos                      _U_(21)                                              /**< (ADC_ISR) Touchscreen YPOS Measure Ready (cleared on read) Position */
#define ADC_ISR_YRDY_Msk                      (_U_(0x1) << ADC_ISR_YRDY_Pos)                       /**< (ADC_ISR) Touchscreen YPOS Measure Ready (cleared on read) Mask */
#define ADC_ISR_YRDY(value)                   (ADC_ISR_YRDY_Msk & ((value) << ADC_ISR_YRDY_Pos))  
#define ADC_ISR_PRDY_Pos                      _U_(22)                                              /**< (ADC_ISR) Touchscreen Pressure Measure Ready (cleared on read) Position */
#define ADC_ISR_PRDY_Msk                      (_U_(0x1) << ADC_ISR_PRDY_Pos)                       /**< (ADC_ISR) Touchscreen Pressure Measure Ready (cleared on read) Mask */
#define ADC_ISR_PRDY(value)                   (ADC_ISR_PRDY_Msk & ((value) << ADC_ISR_PRDY_Pos))  
#define ADC_ISR_DRDY_Pos                      _U_(24)                                              /**< (ADC_ISR) Data Ready (automatically set / cleared) Position */
#define ADC_ISR_DRDY_Msk                      (_U_(0x1) << ADC_ISR_DRDY_Pos)                       /**< (ADC_ISR) Data Ready (automatically set / cleared) Mask */
#define ADC_ISR_DRDY(value)                   (ADC_ISR_DRDY_Msk & ((value) << ADC_ISR_DRDY_Pos))  
#define ADC_ISR_GOVRE_Pos                     _U_(25)                                              /**< (ADC_ISR) General Overrun Error (cleared on read) Position */
#define ADC_ISR_GOVRE_Msk                     (_U_(0x1) << ADC_ISR_GOVRE_Pos)                      /**< (ADC_ISR) General Overrun Error (cleared on read) Mask */
#define ADC_ISR_GOVRE(value)                  (ADC_ISR_GOVRE_Msk & ((value) << ADC_ISR_GOVRE_Pos))
#define ADC_ISR_COMPE_Pos                     _U_(26)                                              /**< (ADC_ISR) Comparison Event (cleared on read) Position */
#define ADC_ISR_COMPE_Msk                     (_U_(0x1) << ADC_ISR_COMPE_Pos)                      /**< (ADC_ISR) Comparison Event (cleared on read) Mask */
#define ADC_ISR_COMPE(value)                  (ADC_ISR_COMPE_Msk & ((value) << ADC_ISR_COMPE_Pos))
#define ADC_ISR_PEN_Pos                       _U_(29)                                              /**< (ADC_ISR) Pen contact (cleared on read) Position */
#define ADC_ISR_PEN_Msk                       (_U_(0x1) << ADC_ISR_PEN_Pos)                        /**< (ADC_ISR) Pen contact (cleared on read) Mask */
#define ADC_ISR_PEN(value)                    (ADC_ISR_PEN_Msk & ((value) << ADC_ISR_PEN_Pos))    
#define ADC_ISR_NOPEN_Pos                     _U_(30)                                              /**< (ADC_ISR) No Pen Contact (cleared on read) Position */
#define ADC_ISR_NOPEN_Msk                     (_U_(0x1) << ADC_ISR_NOPEN_Pos)                      /**< (ADC_ISR) No Pen Contact (cleared on read) Mask */
#define ADC_ISR_NOPEN(value)                  (ADC_ISR_NOPEN_Msk & ((value) << ADC_ISR_NOPEN_Pos))
#define ADC_ISR_PENS_Pos                      _U_(31)                                              /**< (ADC_ISR) Pen Detect Status Position */
#define ADC_ISR_PENS_Msk                      (_U_(0x1) << ADC_ISR_PENS_Pos)                       /**< (ADC_ISR) Pen Detect Status Mask */
#define ADC_ISR_PENS(value)                   (ADC_ISR_PENS_Msk & ((value) << ADC_ISR_PENS_Pos))  
#define ADC_ISR_Msk                           _U_(0xE7780FFF)                                      /**< (ADC_ISR) Register Mask  */

