virtualabs/cutcutgo/src/packs/ATSAMA5D27CD1G_DFP/component/adc.h
/* -------- ADC_COR : (ADC Offset: 0x4C) (R/W 32) Channel Offset Register -------- */
#define ADC_COR_DIFF0_Pos                     _U_(16)                                              /**< (ADC_COR) Differential Inputs for Channel 0 Position */
#define ADC_COR_DIFF0_Msk                     (_U_(0x1) << ADC_COR_DIFF0_Pos)                      /**< (ADC_COR) Differential Inputs for Channel 0 Mask */
#define ADC_COR_DIFF0(value)                  (ADC_COR_DIFF0_Msk & ((value) << ADC_COR_DIFF0_Pos))
#define ADC_COR_DIFF1_Pos                     _U_(17)                                              /**< (ADC_COR) Differential Inputs for Channel 1 Position */
#define ADC_COR_DIFF1_Msk                     (_U_(0x1) << ADC_COR_DIFF1_Pos)                      /**< (ADC_COR) Differential Inputs for Channel 1 Mask */
#define ADC_COR_DIFF1(value)                  (ADC_COR_DIFF1_Msk & ((value) << ADC_COR_DIFF1_Pos))
#define ADC_COR_DIFF2_Pos                     _U_(18)                                              /**< (ADC_COR) Differential Inputs for Channel 2 Position */
#define ADC_COR_DIFF2_Msk                     (_U_(0x1) << ADC_COR_DIFF2_Pos)                      /**< (ADC_COR) Differential Inputs for Channel 2 Mask */
#define ADC_COR_DIFF2(value)                  (ADC_COR_DIFF2_Msk & ((value) << ADC_COR_DIFF2_Pos))
#define ADC_COR_DIFF3_Pos                     _U_(19)                                              /**< (ADC_COR) Differential Inputs for Channel 3 Position */
#define ADC_COR_DIFF3_Msk                     (_U_(0x1) << ADC_COR_DIFF3_Pos)                      /**< (ADC_COR) Differential Inputs for Channel 3 Mask */
#define ADC_COR_DIFF3(value)                  (ADC_COR_DIFF3_Msk & ((value) << ADC_COR_DIFF3_Pos))
#define ADC_COR_DIFF4_Pos                     _U_(20)                                              /**< (ADC_COR) Differential Inputs for Channel 4 Position */
#define ADC_COR_DIFF4_Msk                     (_U_(0x1) << ADC_COR_DIFF4_Pos)                      /**< (ADC_COR) Differential Inputs for Channel 4 Mask */
#define ADC_COR_DIFF4(value)                  (ADC_COR_DIFF4_Msk & ((value) << ADC_COR_DIFF4_Pos))
#define ADC_COR_DIFF5_Pos                     _U_(21)                                              /**< (ADC_COR) Differential Inputs for Channel 5 Position */
#define ADC_COR_DIFF5_Msk                     (_U_(0x1) << ADC_COR_DIFF5_Pos)                      /**< (ADC_COR) Differential Inputs for Channel 5 Mask */
#define ADC_COR_DIFF5(value)                  (ADC_COR_DIFF5_Msk & ((value) << ADC_COR_DIFF5_Pos))
#define ADC_COR_DIFF6_Pos                     _U_(22)                                              /**< (ADC_COR) Differential Inputs for Channel 6 Position */
#define ADC_COR_DIFF6_Msk                     (_U_(0x1) << ADC_COR_DIFF6_Pos)                      /**< (ADC_COR) Differential Inputs for Channel 6 Mask */
#define ADC_COR_DIFF6(value)                  (ADC_COR_DIFF6_Msk & ((value) << ADC_COR_DIFF6_Pos))
#define ADC_COR_DIFF7_Pos                     _U_(23)                                              /**< (ADC_COR) Differential Inputs for Channel 7 Position */
#define ADC_COR_DIFF7_Msk                     (_U_(0x1) << ADC_COR_DIFF7_Pos)                      /**< (ADC_COR) Differential Inputs for Channel 7 Mask */
#define ADC_COR_DIFF7(value)                  (ADC_COR_DIFF7_Msk & ((value) << ADC_COR_DIFF7_Pos))
#define ADC_COR_DIFF8_Pos                     _U_(24)                                              /**< (ADC_COR) Differential Inputs for Channel 8 Position */
#define ADC_COR_DIFF8_Msk                     (_U_(0x1) << ADC_COR_DIFF8_Pos)                      /**< (ADC_COR) Differential Inputs for Channel 8 Mask */
#define ADC_COR_DIFF8(value)                  (ADC_COR_DIFF8_Msk & ((value) << ADC_COR_DIFF8_Pos))
#define ADC_COR_DIFF9_Pos                     _U_(25)                                              /**< (ADC_COR) Differential Inputs for Channel 9 Position */
#define ADC_COR_DIFF9_Msk                     (_U_(0x1) << ADC_COR_DIFF9_Pos)                      /**< (ADC_COR) Differential Inputs for Channel 9 Mask */
#define ADC_COR_DIFF9(value)                  (ADC_COR_DIFF9_Msk & ((value) << ADC_COR_DIFF9_Pos))
#define ADC_COR_DIFF10_Pos                    _U_(26)                                              /**< (ADC_COR) Differential Inputs for Channel 10 Position */
#define ADC_COR_DIFF10_Msk                    (_U_(0x1) << ADC_COR_DIFF10_Pos)                     /**< (ADC_COR) Differential Inputs for Channel 10 Mask */
#define ADC_COR_DIFF10(value)                 (ADC_COR_DIFF10_Msk & ((value) << ADC_COR_DIFF10_Pos))
#define ADC_COR_DIFF11_Pos                    _U_(27)                                              /**< (ADC_COR) Differential Inputs for Channel 11 Position */
#define ADC_COR_DIFF11_Msk                    (_U_(0x1) << ADC_COR_DIFF11_Pos)                     /**< (ADC_COR) Differential Inputs for Channel 11 Mask */
#define ADC_COR_DIFF11(value)                 (ADC_COR_DIFF11_Msk & ((value) << ADC_COR_DIFF11_Pos))
#define ADC_COR_Msk                           _U_(0x0FFF0000)                                      /**< (ADC_COR) Register Mask  */

#define ADC_COR_DIFF_Pos                      _U_(16)                                              /**< (ADC_COR Position) Differential Inputs for Channel xx */
#define ADC_COR_DIFF_Msk                      (_U_(0xFFF) << ADC_COR_DIFF_Pos)                     /**< (ADC_COR Mask) DIFF */
#define ADC_COR_DIFF(value)                   (ADC_COR_DIFF_Msk & ((value) << ADC_COR_DIFF_Pos))   

/* -------- ADC_CDR : (ADC Offset: 0x50) ( R/ 32) Channel Data Register -------- */
#define ADC_CDR_DATA_Pos                      _U_(0)                                               /**< (ADC_CDR) Converted Data Position */
#define ADC_CDR_DATA_Msk                      (_U_(0x3FFF) << ADC_CDR_DATA_Pos)                    /**< (ADC_CDR) Converted Data Mask */
#define ADC_CDR_DATA(value)                   (ADC_CDR_DATA_Msk & ((value) << ADC_CDR_DATA_Pos))  
#define ADC_CDR_Msk                           _U_(0x00003FFF)                                      /**< (ADC_CDR) Register Mask  */


/* -------- ADC_ACR : (ADC Offset: 0x94) (R/W 32) Analog Control Register -------- */
#define ADC_ACR_PENDETSENS_Pos                _U_(0)                                               /**< (ADC_ACR) Pen Detection Sensitivity Position */
#define ADC_ACR_PENDETSENS_Msk                (_U_(0x3) << ADC_ACR_PENDETSENS_Pos)                 /**< (ADC_ACR) Pen Detection Sensitivity Mask */
#define ADC_ACR_PENDETSENS(value)             (ADC_ACR_PENDETSENS_Msk & ((value) << ADC_ACR_PENDETSENS_Pos))
#define ADC_ACR_IBCTL_Pos                     _U_(8)                                               /**< (ADC_ACR) ADC Bias Current Control Position */
#define ADC_ACR_IBCTL_Msk                     (_U_(0x3) << ADC_ACR_IBCTL_Pos)                      /**< (ADC_ACR) ADC Bias Current Control Mask */
#define ADC_ACR_IBCTL(value)                  (ADC_ACR_IBCTL_Msk & ((value) << ADC_ACR_IBCTL_Pos))
#define ADC_ACR_Msk                           _U_(0x00000303)                                      /**< (ADC_ACR) Register Mask  */


/* -------- ADC_TSMR : (ADC Offset: 0xB0) (R/W 32) Touchscreen Mode Register -------- */
#define ADC_TSMR_TSMODE_Pos                   _U_(0)                                               /**< (ADC_TSMR) Touchscreen Mode Position */
#define ADC_TSMR_TSMODE_Msk                   (_U_(0x3) << ADC_TSMR_TSMODE_Pos)                    /**< (ADC_TSMR) Touchscreen Mode Mask */
#define ADC_TSMR_TSMODE(value)                (ADC_TSMR_TSMODE_Msk & ((value) << ADC_TSMR_TSMODE_Pos))
#define   ADC_TSMR_TSMODE_NONE_Val            _U_(0x0)                                             /**< (ADC_TSMR) No Touchscreen  */
#define   ADC_TSMR_TSMODE_4_WIRE_NO_PM_Val    _U_(0x1)                                             /**< (ADC_TSMR) 4-wire Touchscreen without pressure measurement  */
#define   ADC_TSMR_TSMODE_4_WIRE_Val          _U_(0x2)                                             /**< (ADC_TSMR) 4-wire Touchscreen with pressure measurement  */
#define   ADC_TSMR_TSMODE_5_WIRE_Val          _U_(0x3)                                             /**< (ADC_TSMR) 5-wire Touchscreen  */
#define ADC_TSMR_TSMODE_NONE                  (ADC_TSMR_TSMODE_NONE_Val << ADC_TSMR_TSMODE_Pos)    /**< (ADC_TSMR) No Touchscreen Position  */
#define ADC_TSMR_TSMODE_4_WIRE_NO_PM          (ADC_TSMR_TSMODE_4_WIRE_NO_PM_Val << ADC_TSMR_TSMODE_Pos) /**< (ADC_TSMR) 4-wire Touchscreen without pressure measurement Position  */
#define ADC_TSMR_TSMODE_4_WIRE                (ADC_TSMR_TSMODE_4_WIRE_Val << ADC_TSMR_TSMODE_Pos)  /**< (ADC_TSMR) 4-wire Touchscreen with pressure measurement Position  */
#define ADC_TSMR_TSMODE_5_WIRE                (ADC_TSMR_TSMODE_5_WIRE_Val << ADC_TSMR_TSMODE_Pos)  /**< (ADC_TSMR) 5-wire Touchscreen Position  */
#define ADC_TSMR_TSAV_Pos                     _U_(4)                                               /**< (ADC_TSMR) Touchscreen Average Position */
#define ADC_TSMR_TSAV_Msk                     (_U_(0x3) << ADC_TSMR_TSAV_Pos)                      /**< (ADC_TSMR) Touchscreen Average Mask */
#define ADC_TSMR_TSAV(value)                  (ADC_TSMR_TSAV_Msk & ((value) << ADC_TSMR_TSAV_Pos))
#define   ADC_TSMR_TSAV_NO_FILTER_Val         _U_(0x0)                                             /**< (ADC_TSMR) No Filtering. Only one ADC conversion per measure  */
#define   ADC_TSMR_TSAV_AVG2CONV_Val          _U_(0x1)                                             /**< (ADC_TSMR) Averages 2 ADC conversions  */
#define   ADC_TSMR_TSAV_AVG4CONV_Val          _U_(0x2)                                             /**< (ADC_TSMR) Averages 4 ADC conversions  */
#define   ADC_TSMR_TSAV_AVG8CONV_Val          _U_(0x3)                                             /**< (ADC_TSMR) Averages 8 ADC conversions  */
#define ADC_TSMR_TSAV_NO_FILTER               (ADC_TSMR_TSAV_NO_FILTER_Val << ADC_TSMR_TSAV_Pos)   /**< (ADC_TSMR) No Filtering. Only one ADC conversion per measure Position  */
#define ADC_TSMR_TSAV_AVG2CONV                (ADC_TSMR_TSAV_AVG2CONV_Val << ADC_TSMR_TSAV_Pos)    /**< (ADC_TSMR) Averages 2 ADC conversions Position  */
#define ADC_TSMR_TSAV_AVG4CONV                (ADC_TSMR_TSAV_AVG4CONV_Val << ADC_TSMR_TSAV_Pos)    /**< (ADC_TSMR) Averages 4 ADC conversions Position  */
#define ADC_TSMR_TSAV_AVG8CONV                (ADC_TSMR_TSAV_AVG8CONV_Val << ADC_TSMR_TSAV_Pos)    /**< (ADC_TSMR) Averages 8 ADC conversions Position  */
#define ADC_TSMR_TSFREQ_Pos                   _U_(8)                                               /**< (ADC_TSMR) Touchscreen Frequency Position */
#define ADC_TSMR_TSFREQ_Msk                   (_U_(0xF) << ADC_TSMR_TSFREQ_Pos)                    /**< (ADC_TSMR) Touchscreen Frequency Mask */
#define ADC_TSMR_TSFREQ(value)                (ADC_TSMR_TSFREQ_Msk & ((value) << ADC_TSMR_TSFREQ_Pos))
#define ADC_TSMR_TSSCTIM_Pos                  _U_(16)                                              /**< (ADC_TSMR) Touchscreen Switches Closure Time Position */
#define ADC_TSMR_TSSCTIM_Msk                  (_U_(0xF) << ADC_TSMR_TSSCTIM_Pos)                   /**< (ADC_TSMR) Touchscreen Switches Closure Time Mask */
#define ADC_TSMR_TSSCTIM(value)               (ADC_TSMR_TSSCTIM_Msk & ((value) << ADC_TSMR_TSSCTIM_Pos))
#define ADC_TSMR_NOTSDMA_Pos                  _U_(22)                                              /**< (ADC_TSMR) No TouchScreen DMA Position */
#define ADC_TSMR_NOTSDMA_Msk                  (_U_(0x1) << ADC_TSMR_NOTSDMA_Pos)                   /**< (ADC_TSMR) No TouchScreen DMA Mask */
#define ADC_TSMR_NOTSDMA(value)               (ADC_TSMR_NOTSDMA_Msk & ((value) << ADC_TSMR_NOTSDMA_Pos))
#define ADC_TSMR_PENDET_Pos                   _U_(24)                                              /**< (ADC_TSMR) Pen Contact Detection Enable Position */
#define ADC_TSMR_PENDET_Msk                   (_U_(0x1) << ADC_TSMR_PENDET_Pos)                    /**< (ADC_TSMR) Pen Contact Detection Enable Mask */
#define ADC_TSMR_PENDET(value)                (ADC_TSMR_PENDET_Msk & ((value) << ADC_TSMR_PENDET_Pos))
#define ADC_TSMR_PENDBC_Pos                   _U_(28)                                              /**< (ADC_TSMR) Pen Detect Debouncing Period Position */
#define ADC_TSMR_PENDBC_Msk                   (_U_(0xF) << ADC_TSMR_PENDBC_Pos)                    /**< (ADC_TSMR) Pen Detect Debouncing Period Mask */
#define ADC_TSMR_PENDBC(value)                (ADC_TSMR_PENDBC_Msk & ((value) << ADC_TSMR_PENDBC_Pos))
#define ADC_TSMR_Msk                          _U_(0xF14F0F33)                                      /**< (ADC_TSMR) Register Mask  */


/* -------- ADC_XPOSR : (ADC Offset: 0xB4) ( R/ 32) Touchscreen X Position Register -------- */
#define ADC_XPOSR_XPOS_Pos                    _U_(0)                                               /**< (ADC_XPOSR) X Position Position */
#define ADC_XPOSR_XPOS_Msk                    (_U_(0xFFF) << ADC_XPOSR_XPOS_Pos)                   /**< (ADC_XPOSR) X Position Mask */
#define ADC_XPOSR_XPOS(value)                 (ADC_XPOSR_XPOS_Msk & ((value) << ADC_XPOSR_XPOS_Pos))
#define ADC_XPOSR_XSCALE_Pos                  _U_(16)                                              /**< (ADC_XPOSR) Scale of XPOS Position */
#define ADC_XPOSR_XSCALE_Msk                  (_U_(0xFFF) << ADC_XPOSR_XSCALE_Pos)                 /**< (ADC_XPOSR) Scale of XPOS Mask */
#define ADC_XPOSR_XSCALE(value)               (ADC_XPOSR_XSCALE_Msk & ((value) << ADC_XPOSR_XSCALE_Pos))
#define ADC_XPOSR_Msk                         _U_(0x0FFF0FFF)                                      /**< (ADC_XPOSR) Register Mask  */


